backend/app/controllers/bookings_controller.rb

SELECT bookings.*, films.tittle FROM "bookings" INNER JOIN "films" ON "films"."id" = "bookings"."film_id"
---
 def index
  @bookings = Booking.select("bookings.*, films.tittle").joins(:film)

INSERT INTO "bookings" ("film_id", "day", "cedula", "nombre", "correo", "celular", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
def create
  @booking = Booking.new(booking_params)

  if @booking.save

SELECT bookings.*, films.tittle FROM "bookings" INNER JOIN "films" ON "films"."id" = "bookings"."film_id" WHERE "bookings"."film_id" = ?  [["film_id", 1]]
---
def getBookingsFor
  @bookingsFor = Booking.select("bookings.*, films.tittle").joins(:film).where(film: params[:idFilm])

SELECT bookings.*, films.tittle FROM "bookings" INNER JOIN "films" ON "films"."id" = "bookings"."film_id" WHERE (day BETWEEN '2020-01-19' AND '2020-02-19')
---
def getbookingsIn
  begin
    startDayGiven = Date.parse(params[:dStart])
    endDayGiven = Date.parse(params[:dEnd])

    @bookings = Booking.select("bookings.*, films.tittle").joins(:film).where("day BETWEEN ? AND ?", startDayGiven, endDayGiven)

SELECT "bookings".* FROM "bookings" WHERE (day BETWEEN '2020-02-19' AND '2020-03-19')
---
    def set_booking
      @booking = Booking.find(params[:id])