backend/app/controllers/films_controller.rb

SELECT "films".* FROM "films" WHERE ((startDay BETWEEN '2020-01-23' AND '2020-01-31') OR (endDate BETWEEN '2020-01-23' AND '2020-01-31') or (startDay <= '2020-01-23' AND endDate >= '2020-01-31'))
SELECT "films".* FROM "films" WHERE ((startDay BETWEEN '2020-02-22' AND '2020-03-22') OR (endDate BETWEEN '2020-02-22' AND '2020-03-22') or (startDay <= '2020-02-22' AND endDate >= '2020-03-22'))
SELECT bookings.* FROM "bookings" INNER JOIN "films" ON "films"."id" = "bookings"."film_id" WHERE "bookings"."film_id" = ?  [["film_id", 1]]
---
  def getfilmsIn
    begin
      startDayGiven = Date.parse(params[:dStart])
      endDayGiven = Date.parse(params[:dEnd])
      @films = Film.where("(startDay BETWEEN ? AND ?) OR (endDate BETWEEN ? AND ?) or (startDay <= ? AND endDate >= ?)", startDayGiven, endDayGiven, startDayGiven, endDayGiven, startDayGiven, endDayGiven)

      lockedList = []

      @films.each do |film|
        bookings = (Booking.select("bookings.*").joins(:film).where(film: film.id)).length()

INSERT INTO "films" ("tittle", "synopsis", "image", "startDay", "endDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @film = Film.new(film_params)

    if @film.save

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_film
      @film = Film.find(params[:id])